Hi @poroping ,

I have tried also with that code and return error 500:

Terraform will perform the following actions:

  # fortios_firewall_vip.VIP_BACKOFFICE-TOLLPASS-BG will be created
  + resource "fortios_firewall_vip" "VIP_BACKOFFICE-TOLLPASS-BG" { 
      + arp_reply                        = (known after apply)     
      + color                            = (known after apply)     
      + dns_mapping_ttl                  = (known after apply)     
      + extintf                          = "any"
      + extip                            = "172.17.53.225"
      + extport                          = (known after apply)
      + fosid                            = (known after apply)
      + gratuitous_arp_interval          = (known after apply)
      + http_cookie_age                  = (known after apply)
      + http_cookie_domain               = (known after apply)
      + http_cookie_domain_from_host     = (known after apply)
      + http_cookie_generation           = (known after apply)
      + http_cookie_path                 = (known after apply)
      + http_cookie_share                = (known after apply)
      + http_ip_header                   = (known after apply)
      + http_ip_header_name              = (known after apply)
      + http_multiplex                   = (known after apply)
      + https_cookie_secure              = (known after apply)
      + id                               = (known after apply)
      + ldb_method                       = (known after apply)
      + mapped_addr                      = "telepass.backoffice.tollpass.bg"
      + mappedport                       = (known after apply)
      + max_embryonic_connections        = (known after apply)
      + name                             = "VIP_172.17.53.225_BACKOFFICE-TOLLPASS-BG"
      + nat_source_vip                   = (known after apply)
      + outlook_web_access               = (known after apply)
      + persistence                      = (known after apply)
      + portforward                      = (known after apply)
      + portmapping_type                 = (known after apply)
      + protocol                         = (known after apply)
      + server_type                      = (known after apply)
      + ssl_algorithm                    = (known after apply)
      + ssl_certificate                  = (known after apply)
      + ssl_client_fallback              = (known after apply)
      + ssl_client_renegotiation         = (known after apply)
      + ssl_client_session_state_max     = (known after apply)
      + ssl_client_session_state_timeout = (known after apply)
      + ssl_client_session_state_type    = (known after apply)
      + ssl_dh_bits                      = (known after apply)
      + ssl_hpkp                         = (known after apply)
      + ssl_hpkp_age                     = (known after apply)
      + ssl_hpkp_backup                  = (known after apply)
      + ssl_hpkp_include_subdomains      = (known after apply)
      + ssl_hpkp_primary                 = (known after apply)
      + ssl_hsts                         = (known after apply)
      + ssl_hsts_age                     = (known after apply)
      + ssl_hsts_include_subdomains      = (known after apply)
      + ssl_http_location_conversion     = (known after apply)
      + ssl_http_match_host              = (known after apply)
      + ssl_max_version                  = (known after apply)
      + ssl_min_version                  = (known after apply)
      + ssl_mode                         = (known after apply)
      + ssl_pfs                          = (known after apply)
      + ssl_send_empty_frags             = (known after apply)
      + ssl_server_algorithm             = (known after apply)
      + ssl_server_max_version           = (known after apply)
      + ssl_server_min_version           = (known after apply)
      + ssl_server_session_state_max     = (known after apply)
      + ssl_server_session_state_timeout = (known after apply)
      + ssl_server_session_state_type    = (known after apply)
      + type                             = "fqdn"
      + uuid                             = (known after apply)
      + weblogic_server                  = (known after apply)
      + websphere_server                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by    
│ the current configuration.
│
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when 
│ Terraform specifically suggests to use it as part of an error message.
╵

Do you want to perform these actions in workspace "dr"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_vip.VIP_BACKOFFICE-TOLLPASS-BG: Creating...
╷
│ Warning: Applied changes may be incomplete
│
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output    
│ values may not be fully updated. Run the following command to verify that no other changes are pending:
│     terraform plan
│
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors   
│ or mistakes, or when Terraform specifically suggests to use it as part of an error message.
╵
╷
│ Error: Error creating FirewallVip resource: Internal Server Error - Internal error when processing the request (500)
│
│   with fortios_firewall_vip.VIP_BACKOFFICE-TOLLPASS-BG,
│   on common_addresses.tf line 1582, in resource "fortios_firewall_vip" "VIP_BACKOFFICE-TOLLPASS-BG":
│ 1582: resource "fortios_firewall_vip" "VIP_BACKOFFICE-TOLLPASS-BG" {